%--------------------------------------------------------------------------
%   point = cfd2frac(sig,index,width)
%--------------------------------------------------------------------------
%   功能：
%   恒比定时算法，得到回波信号的精确时间
%--------------------------------------------------------------------------
%   输入：
%           sig                 输入的回波信号
%           index               选取的波形ad采样点序号
%           width               摘取波形的前后宽度 [front back]
%   输出：
%           point               返回信号的精确小数点时间
%--------------------------------------------------------------------------
%   例子：
%   回波信号sig中第78是信号的最大值，摘取78点前8后9点波形计算回波信号的精确时间
%   point = cfd2frac(sig,78,[8 9])
%--------------------------------------------------------------------------
function point = cfd2frac(sig,index,width)
for jdx = 1:length(index)
    wave = sig(index(jdx) - width(1):index(jdx) + width(2));                %摘取波形
    wave(wave<0)=0;                                                         %波形负面积剔除
    wave1 = [wave(:);0];
    wave2 = [0;wave(:)];
    diff_wave = wave1 - wave2;
    %--------------------------------------------------------------------------
    %   寻找过零点
    %--------------------------------------------------------------------------
    L(:,1) = diff_wave>0;
    L(:,2) = diff_wave<0;
    for idx = 1:size(L,1)-1
        if (L(idx,1)==1 && L(idx + 1,2) == 1)
            break
        end
    end
    a = diff_wave(idx);b = abs(diff_wave(idx+1));
    frac_point = a/(a+b);                                                   %相似三角形得到小数点
    point(jdx) = index(jdx) - width(1) + idx + frac_point;                  %返回定时小数点
end
end