%--------------------------------------------------------------------------
%   wave = cosine_jamming(T,Am,fm,fs)
%--------------------------------------------------------------------------
%   功能：
%   余弦调相转发干扰
%--------------------------------------------------------------------------
%   输入：
%           T                   信号持续时间
%           A                   余弦干扰幅度
%           B                   调制指数
%           fm                  余弦干扰频率
%           fs                  生成信号采样率
%   输出：
%           J                   余弦干扰波形
%--------------------------------------------------------------------------
%   例子:
%   J = cosine_jamming(T,A,B,fm,fs)
%   spectrogram(sig,128,127,128,fs,'yaxis');
%--------------------------------------------------------------------------
function J = cosine_jamming(T,A,B,fm,fs)
arguments(Input)
    T       (1,1)   double = 1
    A       (1,1)   double = 1
    B       (1,1)   double = 1
    fm      (1,1)   double = 1
    fs      (1,1)   double = 1
end
arguments(Output)
    J       (:,1)   double
end

t_axis = (0:1/fs:(T-1/fs))';                                                %生成时间轴
J = A.*exp(1j.*B*cos(2*pi*fm*t_axis));                                      %生成余弦干扰
end