%--------------------------------------------------------------------------
%   dp_noise = doppler_noise(T,fd,delta,fs)
%--------------------------------------------------------------------------
%   功能：
%   在回波信号添加一个多普勒噪声(带有频偏+随机过程相位)
%--------------------------------------------------------------------------
%   输入：
%           T                   信号持续时间
%           fd                  多普勒频率
%           delta               多普勒噪声标准差
%           fs                  表达频率(采样率)
%   输出：
%           dp_noise            多普勒噪声信号(Nx1)
%--------------------------------------------------------------------------
%   参考文献:
%   《弹载雷达有源干扰认知数字分系统设计与试验研究》
%--------------------------------------------------------------------------
%   例子：
%   dp_noise = doppler_noise(T,fd,delta,fs)
%--------------------------------------------------------------------------
function dp_noise = doppler_noise(T,fd,delta,fs)
arguments (Input)
    T           (1,1)       double = 1
    fd          (1,1)       double = 1
    delta       (1,1)       double = 1
    fs          (1,1)       double = 1
end
arguments (Output)
    dp_noise        (:,:)       double
end
t = (0:1/fs:T-1/fs)';                                                       %干扰信号时间轴
N = numel(t);                                                               %信号总长度

dp_noise = exp(1j.*(2*pi*fd*t + delta.*randn(N,1)));                        %多普勒点频+随机噪声
end