%--------------------------------------------------------------------------
%   wave = doppler_flicker(T,T_cycle,fd1,fd2,fs)
%--------------------------------------------------------------------------
%   功能：
%   对原始信号产生多普勒闪烁，即为在回波信号上转发一个多普勒频偏
%--------------------------------------------------------------------------
%   输入：
%           T                   持续时间
%           T_cycle             闪烁周期
%           rate                占空比 0-100之间 默认50  即为50%
%           fd1                 多普勒闪烁频偏fd1
%           fd2                 多普勒闪烁频偏fd2
%           fs                  信号生成采样率
%   输出：
%           wave                信号波形
%--------------------------------------------------------------------------
%   参考文献:
%   复杂干扰模拟器的信号分选与干扰子系统设计与实现
%--------------------------------------------------------------------------
%   例子：
%   wave = doppler_flicker(sig,1e3,1e-2,T)
%--------------------------------------------------------------------------
function wave = doppler_flicker(T,T_cycle,rate,fd1,fd2,fs)
arguments (Input)
    T           (1,1)           double = 1
    T_cycle     (1,1)           double = 1
    rate        (1,1)           double = 1
    fd1         (1,1)           double = 1
    fd2         (1,1)           double = 1
    fs          (1,1)           double = 1
end
arguments (Output)
    wave        (:,1) 
end
t_axis = (0:1/fs:(T-1/fs))';                                                %时间轴
sq = square(2*pi*1/T_cycle.*t_axis,rate);                                   %生成方波
phi1 = exp(1j*2*pi*fd1*t_axis);                                             %多普勒频率fd1
phi2 = exp(1j*2*pi*fd2*t_axis);                                             %多普勒频率fd2
wave = phi1.*(sq==1) + phi2.*(sq == -1);                                    %拼接
end