%--------------------------------------------------------------------------
%   output = filter_w(w,sig)
%--------------------------------------------------------------------------
%   功能:
%   矢量滤波器与矢量信号卷积
%--------------------------------------------------------------------------
%   输入:
%           w           滤波器系数 按照列放置
%           sig         待卷积信号 按照列放置
%	output：
%           output      卷积输出
%--------------------------------------------------------------------------
%   例子1:
%   多组列信号卷积一个列滤波器
%   w = zeros(20,1);
%   sig = randn(20,100);
%   filter_w(w,sig)
%   
%   例子2：
%   多组列信号卷积多组列滤波器
%   w = ones(20,30)
%   sig = randn(4096,30);
%   output = filter_w(w,sig)
%--------------------------------------------------------------------------
function output = filter_w(w,sig)
output = zeros(size(sig)+[size(w,1)-1 0]);
if size(w,2) == 1

    for idx = 1:size(sig,2)
        output(:,idx) = conv(w,sig(:,idx));
    end
elseif size(w,2) == size(sig,2)
    for idx = 1:size(sig,2)
        output(:,idx) = conv(w(:,idx),sig(:,idx));
    end
else
    disp('向量长度不匹配')
    output = [];
end