%--------------------------------------------------------------------------
%   findhead(data,target)
%--------------------------------------------------------------------------
%   功能：
%   搜索数据中的包头
%--------------------------------------------------------------------------
%   输入:
%           data         输入数据
%           target       包头
%   输出:
%           index        包头坐标  
%--------------------------------------------------------------------------
%   例子:
%   findhead(data,target)
%--------------------------------------------------------------------------
function index = findhead(data,target)
data = data(:);
target = target(:);
N = length(target);
for idx = 1:N
    L(:,idx) = circshift(data == target(idx),1-idx);
end
L = sum(L,2);
index = find(L == N);
end
