%--------------------------------------------------------------------------
%   [X,Y,Z] = fov2vector(angle_shape,shape)
%--------------------------------------------------------------------------
%   功能:
%   相机的fov角度转换为光路的矢量坐标系
%--------------------------------------------------------------------------
%   输入:
%           angle_shape             水平和垂直视场角 单位是角度
%           shape                   传感器图像尺寸[u v]
%   输出:
%           X                       →为X方向
%           Y                       ↓为Y方向
%           Z                       ×为Z方向
%--------------------------------------------------------------------------
%   例子:
%   [X,Y,Z] = fov2vector([60 40],[320 240]);
%--------------------------------------------------------------------------
function [X,Y,Z] = fov2vector(angle_shape,shape)
h_angle = angle_shape(1);
v_angle = angle_shape(2);
h = linspace(-h_angle/2,h_angle/2,shape(1));
v = linspace(-v_angle/2,v_angle/2,shape(2));
[H,V] = meshgrid(h,v);
X = 1.*tand(H);                                                             %水平方向矢量
Y = 1.*tand(V);                                                             %垂直方向矢量
Z = 1.*ones(fliplr(shape));
%--------------------------------------------------------------------------
%   矢量归一化
%--------------------------------------------------------------------------
for idx = 1:shape(1)*shape(2)
    R = norm([X(idx) Y(idx) Z(idx)]);
    X(idx) = X(idx)./R;
    Y(idx) = Y(idx)./R;
    Z(idx) = Z(idx)./R;
end
