%--------------------------------------------------------------------------
%   width_P = get_pulse_width(sig,index,width)
%--------------------------------------------------------------------------
%   功能：
%   获取脉冲信号的半高宽度得到脉宽
%--------------------------------------------------------------------------
%   输入:
%           sig                         回波信号
%           index                       信号摘取部分
%           width                       信号前后宽度
%   输出:
%           width_point                 %信号半高宽度
%--------------------------------------------------------------------------
%   例子：
%   width_P = get_pulse_width(sig,[35 40],[20 30])
%--------------------------------------------------------------------------
function width_P = get_pulse_width(sig,index,width)
for idx = 1:length(index)
    wave = sig(index(idx) - width(1):index(idx) + width(2));                %摘取波形
    wave(wave<0)=0;                                                         %波形负面积剔除
    half_value = max(wave)/2;                                               %获取半高值
    L = find(wave>half_value);                                              %获取起始结尾坐标
    %----------------------------------------------------------------------
    %	利用相似三角形得到精确脉冲宽度
    %----------------------------------------------------------------------
    st = L(1);en = L(end);
    start_p = half_value./wave(st)+st-1;
    end_p = en+1-half_value./wave(en);
    width_P(idx) = end_p-start_p;                                           %得到脉冲宽度
end
end