%--------------------------------------------------------------------------
%   get_width(sig)
%--------------------------------------------------------------------------
%   功能：
%   获取信号的最大值 最小值 位宽
%--------------------------------------------------------------------------
%   输入:
%           sig         输入信号
%--------------------------------------------------------------------------
%   例子:
%   get_width(sig)
%--------------------------------------------------------------------------
function get_width(sig)
sig = double(sig(:));
r_sig = real(sig);
i_sig = imag(sig);
sig = table([max(r_sig);min(r_sig)],[max(i_sig);min(i_sig)]);

sig.Properties.VariableNames = {'实部','虚部'};
sig.Properties.RowNames = {'最大值','最小值'};
width = table(nextpow2([max(r_sig);min(r_sig)]),nextpow2([max(i_sig);min(i_sig)]));
width.Properties.VariableNames = {'实部','虚部'};
width.Properties.RowNames = {'最大值','最小值'};
disp('------------------------------------')
disp('  信号')
disp('------------------------------------')
disp(sig)
disp('------------------------------------')
disp('  位宽')
disp('------------------------------------')
disp(width)
disp('------------------------------------')
end


