%--------------------------------------------------------------------------
%   get_area_s(sig,index,width)
%--------------------------------------------------------------------------
%   功能：
%   根据回波信号以及反馈序号进行摘取，并计算选取波形的面积
%--------------------------------------------------------------------------
%   输入：
%           sig                 输入的回波信号
%           index               选取的波形ad采样点序号
%           width               摘取波形的前后宽度 [front back]
%   输出：
%           s                   返回选取波形的面积
%--------------------------------------------------------------------------
%   例子：
%   回波信号sig中第78是信号的最大值，摘取78点前7后8点波形计算面积，如果
%   如果遇到负值，按照0计算
%   s = get_area_s(sig,78,[8 9])
%--------------------------------------------------------------------------
function s = get_area_s(sig,index,width)
for idx = 1:length(index)
    wave = sig(index(idx) - width(1):index(idx) + width(2));                %摘取波形
    wave(wave<0)=0;                                                         %波形负面积剔除
    s(idx) = sum(wave)/(sum(width)+1);                                      %计算面积输出 节省运算不做平均
end