%--------------------------------------------------------------------------
%   h = hlagr2(L,x)
%--------------------------------------------------------------------------
%   功能:
%   拉格朗日分数延迟滤波器，拉格朗日插值法实现信号分数延迟
%   (注意,仅适用于实数信号，复数信号需要补偿载波相位)
%--------------------------------------------------------------------------
%   输入：
%           L           FIR滤波器点数(注意滤波器阶数为L-1)
%           x           分数延迟点数
%   输出：  
%           h           滤波器
%--------------------------------------------------------------------------
%   例子：
%   hlagr2(10,0.2)
%   hlagr2(15,1.37)
%--------------------------------------------------------------------------
function h = hlagr2(L,x)
x = x(:);
N = L-1;                                                                    % filter order
M = N/2;                                                                    % middle value
if (M-round(M))==0 
    D= x + M;                                                               % integer part closest to middle
else
    D= x + M - 0.5;
end
h=ones(N+1,numel(x));
for idx = 1:numel(D)
    for n=0:N          
        n1=n+1;
        for k=0:N
            if (k~=n)
                h(n1,idx) = h(n1)*(D(idx)-k)/(n-k);
            end
        end
    end
end