%--------------------------------------------------------------------------
%   [T_axis,F_axis] = ifm(sig,fs,window_len)
%--------------------------------------------------------------------------
%   功能：
%   瞬时测频
%--------------------------------------------------------------------------
%   输入:
%           sig         输入信号
%           fs          采样速率
%           window_len  平滑窗长
%   输出：
%           T_axis      时间轴
%           F_axis      测频轴
%--------------------------------------------------------------------------
%   例子:
%   ifm(sig,fs,window_len)
%--------------------------------------------------------------------------
function [T_axis,F_axis] = ifm(sig,fs,window_len)
if nargin <= 2
	window_len = 1;
end
T = 1/fs;
fai_hat = angle([sig;0]./[0;sig]);                                          %复数除法得到夹角,不用解缠绕
f = fai_hat(1:end-1)./2./pi./T;
F_axis = smooth(f,window_len);
T_axis = (0:length(f)-1).*T;
end