%--------------------------------------------------------------------------
%   [dataout] = l_steering_vector(d,N,lambda,theta_d,win)
%--------------------------------------------------------------------------
%   功能:
%   线阵导向矢量快速计算工具
%--------------------------------------------------------------------------
%   输入:
%           d                       阵列间距
%           N                       阵元数
%           lambda                  波长
%           theta_d                 指向角
%           win                     窗函数
%   输出:
%           A                       导向矢量
%--------------------------------------------------------------------------
function A = l_steering_vector(d,N,lambda,theta_d,win)
if nargin <= 4
    win = ones(N,1);
end
d_axis = (0:N-1).*d;
A = exp(-1j.*2*pi*d_axis.'*sind(theta_d)./lambda).*win;
end