%--------------------------------------------------------------------------
%   h = lagrange_farrow_matrix(L)
%--------------------------------------------------------------------------
%   功能:
%   拉格朗日farrow滤波器结构
%   (注意,适用于实数信号，复数信号需要补偿载波相位)
%--------------------------------------------------------------------------
%   输入：
%           L           FIR滤波器点数(注意滤波器阶数为L-1)
%   输出：  
%           h           farrow滤波器系数
%--------------------------------------------------------------------------
%   矩阵乘法方式参考sp.lagrange_farrow_interpolation
%--------------------------------------------------------------------------
function h = lagrange_farrow_matrix(L)
N = L-1;                                                                    % 滤波器阶数
M = N/2;                                                                    % 中心值
%--------------------------------------------------------------------------
if (M-round(M))==0 
    N1 = M;
    N2 = M;
else
    N1 = round(M);
    N2 = round(M)-1;
end

P = [];
for k = -N1:N2
    poly_para = 1;
    poly_gain = 1;
    for m = -N1:N2
        if m ~= k
            poly_para = conv(poly_para,[-m -1]);
            poly_gain = poly_gain*(k-m);
        end
    end
    P = [P;poly_para./poly_gain];
end
h = rot90(P,2).';




