%--------------------------------------------------------------------------
%   wave = nlfm_step_wave(T,B,N,fs)
%--------------------------------------------------------------------------
%   功能：
%   非线性调频:正弦调频信号生成工具
%--------------------------------------------------------------------------
%   输入：
%           T                   信号持续时间
%           B                   信号带宽
%           N                   扫频频点
%           fs                  信号采样速率
%   输出：
%           wave                宽带信号波形
%--------------------------------------------------------------------------
%   例子：
%   sig = nlfm_exp_wave(100e-6,60e6,40e3,fs);
%   spectrogram(sig,128,127,128,fs,'yaxis');
%--------------------------------------------------------------------------
function wave = nlfm_step_wave(T,B,N,fs)
arguments (Input)
    T       (1,1)       double = 1
    B       (1,1)       double = 1
    N       (1,1)       double = 1
    fs      (1,1)       double = 1
end
arguments (Output)
    wave    (:,1)
end
B_step = linspace(0,B,N);                                                   %频率分割
delta_T = 1/fs;                                                             %采样间隔
tm = T/N;                                                                   %时间段
t_axis = (0:delta_T:tm-delta_T)';                                           %生成时间轴
wave = exp(1j*2*pi.*B_step.*t_axis);                                        %列时间轴x行频率轴 为各个点频信号 列向量组
wave = wave(:);                                                             %变成列向量输出
end