%--------------------------------------------------------------------------
%   wave = nlfm_saw_wave(T,T_cycle,B,fs)
%--------------------------------------------------------------------------
%   功能：
%   非线性调频:锯齿波调频信号生成工具
%--------------------------------------------------------------------------
%   输入：
%           T                   信号持续时间
%           T_cycle             锯齿波周期
%           B                   扫频带宽
%           fs                  生成信号采样率
%   输出：
%           wave                宽带信号波形
%--------------------------------------------------------------------------
%   例子：
%   sig = nlfm_saw_wave(1e-4,2e-5,30e6,fs);
%   spectrogram(sig,128,127,128,fs,'yaxis');
%--------------------------------------------------------------------------
function wave = nlfm_saw_wave(T,T_cycle,B,fs)
arguments (Input)
    T               (1,1)   double = 1
    T_cycle         (1,1)   double = 1
    B               (1,1)   double = 1
    fs              (1,1)   double = 1
end
arguments (Output)
    wave            (:,1)
end
delta_T = 1/fs;                                                             %采样时间间隔
t_axis = (0:delta_T:T-delta_T)';                                            %采样时间轴
t_axis = mod(t_axis,T_cycle);                                               %取余数构造周期性
mu = 2*pi*B/T_cycle;                                                        %斜率
wave = exp(1j.*(1/2.*mu.*t_axis.^2));                                       %生成波形
end