%--------------------------------------------------------------------------
%   sig = nlm_wave(T,bw,fs,window)
%--------------------------------------------------------------------------
%   功能：
%   非线性调频信号脉冲压缩模板生成工具
%   常用于脉冲多普勒雷达的波形匹配，在频率上进行加窗，延长低频部分相干积累
%   达到压低副瓣的效果
%--------------------------------------------------------------------------
%   输入：
%           T           信号长度
%           bw          信号带宽,分布是从-bw/2到bw/2
%           fs          信号生成速率，按照多少速率来生成信号
%           Window      频率窗函数选择,输入窗函数,例如@hamming,@taylorwin
%   输出：
%           sig         压缩模板波形
%--------------------------------------------------------------------------
%   例子：
%   sig = nlm_wave(20e-6,10e6,100e6,@hamming)
%--------------------------------------------------------------------------
function sig = nlm_wave(T,bw,fs,window)
N  = round(fs * T);
f  = -bw/2:bw/N:bw/2 - bw/N;
t  = 0:1/fs:T - 1/fs;
Wf  = window(N);
Tf  = cumtrapz(f,Wf);

Ft  = interp1(Tf,f,linspace(min(Tf),max(Tf),N));

phi = 2 * pi * cumtrapz(t,Ft);
sig = exp(1j*phi');
end
