%--------------------------------------------------------------------------
%   p3(signal,mark)
%--------------------------------------------------------------------------
%   功能：
%   复信号绘制画图工具，用处较多
%   常见于查看时域复信号，傅里叶变换后信号的幅度和相位信息
%--------------------------------------------------------------------------
%   输入：
%           signal              按照列排列复信号
%           mark                绘制标记，例如'r--','k-.'
%--------------------------------------------------------------------------
%   例子：
%   暂无
%--------------------------------------------------------------------------
function p3(signal,mark)
if nargin==2
    plot3(1:size(signal,1),real(signal),imag(signal),mark);grid on
    xlabel('点数');ylabel('实部');zlabel('虚部')
elseif nargin ==1
    plot3(1:size(signal,1),real(signal),imag(signal));grid on
    xlabel('点数');ylabel('实部');zlabel('虚部')
end