%--------------------------------------------------------------------------
%   [h_sub] = polyphase_filter(h,M)
%--------------------------------------------------------------------------
%   功能：
%   多相抽取滤波器
%--------------------------------------------------------------------------
%   输入:
%           h           输入滤波器系数
%           M           自滤波器数量
%   输出:
%           h_sub       子滤波器系数
%--------------------------------------------------------------------------
%   例子:
%   [h_sub] = polyphase_filter(h,M)
%--------------------------------------------------------------------------
%   正常滤波器:
%   A   B   C
%   1           1A
%   2   1       2A+1B
%   3   2   1   3A+2B+1C  <-抽取
%   4   3   2   4A+3B+2C
%   5   4   3   5A+4B+3C
%   6   5   4   6A+5B+4C  <-抽取
%   多相滤波器:
%   4   1   C
%   5   2   B
%   6   3   A
%           ↓
%           1C+2B+3A
%           4C+5B+6A
%--------------------------------------------------------------------------
function h_sub = polyphase_filter(h,M)
disp('N相滤波器 滤波器输出从第N点抽取(N:N:end)')
if rem(numel(h),M) ~= 0
    disp('滤波器长度不能整除')
    return
end
h = h(:);
h_sub = zeros(numel(h)/M,M);
for idx = 1:M
    h_sub(:,idx) = h(idx:M:end);
end
h_sub= fliplr(h_sub(:,1:end));
end