%--------------------------------------------------------------------------
%   [v_axis,res_v] = prt2axis_v(prt,fc,N)
%--------------------------------------------------------------------------
%   功能:
%   根据雷达发射的PRT时间和载波频率及N点fft点数计算多普勒速度轴
%--------------------------------------------------------------------------
%   输入:
%           prt             脉冲间隔时间 s
%           fc              发射频率
%           N               做fft的点数
%   输出:
%           v_axis          速度轴 m/s
%           res_v           速度最小分辨单元
%--------------------------------------------------------------------------
function [v_axis,res_v] = prt2axis_v(prt,fc,N)
lambda = 3e8/fc;
PRF = 1/prt;
vmax = PRF*lambda/2;
res_v = vmax/N;
disp(['速度最小分辨单元:' num2str(res_v) ' m/s'])
if rem(N,2) == 0
    v_axis = (0:N-1)*res_v - vmax/2;
else
    v_axis = (0:N-1)*res_v - res_v*(N-1)/2;
end
v_axis = v_axis(:);
end
