%--------------------------------------------------------------------------
%   pos = radar2xyz(azimuth_deg, elevation_deg, range)
%--------------------------------------------------------------------------
%   功能：
%   相控阵雷达的方位，俯仰，目标半径转换为x,y,z坐标
%   阵列位于y-z平面内,指向x轴正向
%--------------------------------------------------------------------------
%   输入:
%           azimuth_deg     方位角（单位：度），范围通常为0°～360°，从正北方向顺时针测量
%           elevation_deg   俯仰角（单位：度），范围-90°～+90°，正值表示目标高于水平面
%           range           目标到雷达的直线距离（半径，单位：米或千米）
%   输出:
%           pos = [x y z]'  直角坐标系下的坐标值，默认以雷达位置为原点
%                           X轴指向正前（阵面法线方向）
%                           Y轴向左
%                           Z轴垂直向上
%--------------------------------------------------------------------------
function pos = radar2xyz(azimuth_deg, elevation_deg, range)
    
% 计算XYZ坐标（右手坐标系，X为前向，Y为右向，Z为垂直向上）
x = range * cosd(elevation_deg) * cosd(azimuth_deg);
y = -range * cosd(elevation_deg) * sind(azimuth_deg);
z = range * sind(elevation_deg);
pos = [x y z].';
end