%--------------------------------------------------------------------------
%   T = rotate_ad(vector,thetad)
%--------------------------------------------------------------------------
%   功能：
%   绕着某个轴旋转特定角度的旋转矩阵
%--------------------------------------------------------------------------
%   输入：
%           vector              矢量轴
%           theta               旋转角
%   输出：
%           T                   旋转矩阵
%--------------------------------------------------------------------------
%	例子:
%	vector1 = [1;2;3];
%	xyz = [4 5 6].';
%	rotate_ad(vector1,30)*xyz
%--------------------------------------------------------------------------
function T = rotate_ad(vector,thetad)
vector = vector./norm(vector);
Vx = vector(1);Vy = vector(2);Vz = vector(3);
T = cosd(thetad)*eye(3) + ...
    (1-cosd(thetad))*[Vx^2  Vx*Vy Vx*Vz;...
                    Vy*Vx Vy^2  Vy*Vz;...
                    Vz*Vx Vz*Vy Vz^2] + ...
    sind(thetad)*[ 0  -Vz  Vy;...
                Vz  0  -Vx;...
                -Vy  Vx  0];