%--------------------------------------------------------------------------
%   h = shaping_filter(bt,span,sps,type)
%--------------------------------------------------------------------------
%   功能：
%   成形滤波器
%--------------------------------------------------------------------------
%   输入:
%           bt          滚降系数 (0-1)
%           span        滤波器截断长度 或者 pulselength
%           sps         过采样因子
%           type        默认为'rcos'  根升余弦滤波器 
%                       设置为'gauss' 高斯成型滤波器
%--------------------------------------------------------------------------
%   输出:
%           h           成形滤波器系数
%--------------------------------------------------------------------------
%   例子:
%   shaping_filter(0.3,1,32)
%   shaping_filter(0.3,8,10,'gauss')
%--------------------------------------------------------------------------
function h = shaping_filter(bt,span,sps,type)
if nargin<=3
    type = 'rcos';
end
type = lower(type);

switch type
    case 'rcos'
        h = rcosdesign(bt,span,sps);
    case 'gauss'
        h = gaussdesign(bt,span,sps);
end