%--------------------------------------------------------------------------
%   out = sig_delay(sig,R,fc,fs)
%--------------------------------------------------------------------------
%   功能：
%   信号延迟函数
%--------------------------------------------------------------------------
%   输入:
%           sig         发射复信号，完整的PRT
%           R           传输距离
%           fc          载频波长
%           fs          仿真采样速率
%   输出:
%           out         延迟信号
%--------------------------------------------------------------------------
%   例子:
%   out = sig_delay(sig,R,fc,fs)

%--------------------------------------------------------------------------
function out = sig_delay(sig,R,fc,fs)
%   计算时间延迟
c = 3e8;
lambda = c/fc;
delay_time = R/c;                                                           %计算延迟时间
T = 1/fs;                                                                   %采样间隔
delay_N = round(delay_time/T);                                      		%信号延迟计算整数点
%   计算相位延迟
phi = exp(1j.*R/lambda*2*pi);                                               %传播过程中载频产生的相位旋转
out = [zeros(delay_N,1);sig].*phi;
end
