%--------------------------------------------------------------------------
%   sig = smart_noise(sig,N)
%--------------------------------------------------------------------------
%   功能：
%   灵巧噪声，回波信号卷积噪声反射回去
%--------------------------------------------------------------------------
%   输入：
%           sig         原始信号
%           N           噪声长度
%   输出：
%           wave        灵巧噪声输出
%--------------------------------------------------------------------------
%   例子：
%   wave = smart_noise(sig,N)
%--------------------------------------------------------------------------
function wave = smart_noise(sig,N)
arguments (Input)
    sig     (:,1)       double
    N       (1,1)       double = 1
end
arguments(Output)
    wave    (:,1)       double
end
M = numel(sig);                                                             %计算信号长度
wave = conv(sig,randn(N,1));                                                %卷积噪声
wave = wave(1:M);                                                           %与原信号长度一致
end