%--------------------------------------------------------------------------
%   T = T_mailoux(beta,K,m,n)
%--------------------------------------------------------------------------
%   功能：
%   零陷加深扩张矩阵，高动态抗干扰时候需要零陷展宽，用扩张矩阵对原协方差矩阵
%   处理后零陷展宽，常用于接收机抗干扰系统
%--------------------------------------------------------------------------
%   输入：
%           beta            扩展宽度 degree
%           K               虚拟干扰源
%           m行
%           n列
%--------------------------------------------------------------------------
%   例子:
%   Rx为协方差矩阵
%   Rx_T = Rx.*T_mailoux(0.5,10,N,N);
%--------------------------------------------------------------------------
function T = T_mailoux(beta,K,m,n)
for mdx = 1:m
    for ndx = 1:n
        delta_mn = (mdx-ndx)*pi*deg2rad(beta)/2;
        if mdx == ndx
            T(mdx,ndx) = K;
        else
            T(mdx,ndx) = sin(K*delta_mn)/sin(delta_mn);
        end
    end
end
end