%--------------------------------------------------------------------------
%   wp2frac(sig,index,width)
%--------------------------------------------------------------------------
%   功能：
%   质心算法，得到回波信号的精确时间
%--------------------------------------------------------------------------
%   输入：
%           sig                 输入的回波信号
%           index               选取的波形ad采样点序号
%           width               摘取波形的前后宽度 [front back]
%   输出：
%           point               返回信号的精确小数点时间
%--------------------------------------------------------------------------
%   例子：
%   回波信号sig中第78是信号的最大值，摘取78点前8后9点波形计算质量重心
%   得到回波信号时间
%   point = wp2frac(sig,78,[8 9])
%--------------------------------------------------------------------------
function point = wp2frac(sig,index,width)
wave = sig(index - width(1):index + width(2));                              %摘取波形
wave(wave<0)=0;                                                             %波形负面积剔除
%--------------------------------------------------------------------------
%   计算质量重心
%--------------------------------------------------------------------------
N = numel(wave);
wp = (1:N)*wave(:)./(sum(wave));
point = index - width(1)+wp;
end
